define(['jquery', 'dialog'], function($, dialog) {
    $('body').on('click', '.payRadio', function() {
        var value = $(this).val();
        showxe(value);
    });

    /*限额JS
    1.	10011,工商银行在线支付
    2.	10012,招商银行在线支付
    3.	10013,农业银行在线支付
    4.	10014,建设银行在线支付
    5.	10015,北京银行在线支付		无
    6.	10016,交通银行在线支付
    7.	10017,兴业银行在线支付	
    8.	10019,民生银行在线支付
    9.	10020,光大银行在线支付
    10.	10021,中国银行在线支付 
    11.	 10022,平安银行在线支付   	无
    12.	10025,中信银行在线支付	
    13.	10028,浦发银行在线支付
    14.	10029,邮政储蓄银行在线支付
    15.	10001,银联在线支付       无
    16.	10000,支付宝      无
     * */
    function showxe(payid) {
        $(".disno1").hide();
        $(".disno2").hide();
        $(".disno3").hide();
        $(".disno4").hide();
        $(".disno5").hide();
        $(".xe_sm").show();
        if (payid == "10011") { //10011,工商银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno3").show();
            $(".disno4").show();
            showpay("500", "1000", "电子银行口令卡客户-未开通短信认证", "2000", "5000", "电子银行口令卡客户-开通短信认证", "50万", "100万", "U盾客户", "实际支付限额以在银行柜台设置为准，工行热线：95588", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，工行热线：95588");
        }

        if (payid == "10012") { //10012,招商银行在线支付
            $(".disno1").show();
            $(".disno4").show();
            showpay("用户自行设置", "用户自行设置", "无", "", "", "", "", "", "", "实际支付限额以在银行柜台设置为准，招行热线：95555", "用户自行设置", "用户自行设置", "无", "", "", "", "实际支付限额以在银行柜台设置为准，招行热线：95555");
        }

        if (payid == "10013") { //10013,农业银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno4").show();
            $(".disno5").show();
            showpay("1000", "3000", "动态口令卡", "无限额", "无限额", "农行K宝", "", "", "", "实际支付限额以在银行柜台设置为准，农行热线：95599", "1000", "3000", "动态口令卡", "用户自行设置", "用户自行设置", "农行K宝", "实际支付限额以在银行柜台设置为准，农行热线：95599");
        }
        if (payid == "10014") { //10014,建设银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno4").show();
            showpay("5000", "5000", "短信动态口令/动态口令卡+文件证书", "5万", "10万", "建行银盾客户+动态口令卡/短信动态口令", "", "", "", "实际支付限额以在银行柜台设置为准，建行热线：95533", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，建行热线：95533");
        }
        if (payid == "10015") { //10015,北京银行在线支付		无
            $(".disno1").show();
            $(".disno2").show();
            //$(".disno3").show();
            $(".disno4").show();
            //showpay("无","无","无","","","","","","","无","无","无","无","","","","无");
            showpay("1000", "5000", "开通动态密码版网上支付功能", "100万", "100万", "开通证书版网上支付功能", "", "", "", "实际支付限额以在银行柜台设置为准，北京热线：95526", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，北京热线：95526");
        }

        if (payid == "10016") { //10016,交通银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno4").show();
            $(".disno5").show();
            showpay("5万", "5万", "手机短信密码验证", "100万", "100万", "USBKey证书认证", "", "", "", "实际支付限额以在银行柜台设置为准，交行热线：95559", "5万元与信用卡本身限额孰低", "5万元与信用卡本身限额孰低", "手机短信密码验证", "5万元与信用卡本身限额孰低", "5万元与信用卡本身限额孰低", "USBKey证书认证", "实际支付限额以在银行柜台设置为准，交行热线：95559");
        }
        if (payid == "10017") { //10017,兴业银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno4").show();
            $(".disno5").show();
            showpay("5000", "5000", "网上开通短信口令/动态令牌", "100万", "100万", "证书保护/柜面开通短信口令", "", "", "", "实际支付限额以在银行柜台设置为准，兴业热线：95561", "2000", "2000", "小额信用卡-开通网上支付功能", "5000", "1万", "大额信用卡-开通网上支付功能", "实际支付限额以在银行柜台设置为准，兴业热线：95561");
        }
        if (payid == "10019") { //10019,民生银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno4").show();
            showpay("5000", "5000", "办理短信验证码或者浏览器证书", "50万", "50万", "办理otp或者u宝", "", "", "", "实际支付限额以在银行柜台设置为准，民生热线：95568", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，民生热线：95568");
        }
        if (payid == "10020") { //10020,光大银行在线支付
            $(".disno1").show();
            $(".disno4").show();
            //showpay("无","无","无","","","","","","","无","无","无","无","","","","无");
            showpay("1万", "1万", "手机动态密码", "50万", "50万", "令牌动态密码", "50万", "50万", "阳光网盾", "实际支付限额以在银行柜台设置为准，光大热线：95595", "2000", "2000", "无", "", "", "", "实际支付限额以在银行柜台设置为准，光大热线：95595");
        }
        if (payid == "10021") { //10021,中国银行在线支付 
            $(".disno1").show();
            $(".disno2").show();
            $(".disno3").show();
            $(".disno4").show();
            showpay("5000", "5000", "手机交易码", "50万", "50万", "动态口令牌", "350万", "350万", "数字证书", "实际支付限额以在银行柜台设置为准，中行热线：95566", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，中行热线：95566");
        }
        if (payid == "10022") { //10022,平安银行在线支付   	无
            $(".disno1").show();
            //$(".disno2").show();
            $(".disno4").show();
            $(".disno5").show();
            //showpay("无","无","无","无","无","无","无","无","无","无","无","无","无","无","无","无","无");
            showpay("5万", "5万", "无", "", "", "", "", "", "", "实际支付限额以在银行柜台设置为准，平安热线：95511转3", "2500", "2500", "小额信用卡网银支付", "2万", "2万", "大额信用卡网银支付", "实际支付限额以在银行柜台设置为准，平安热线：95511转3");
        }
        if (payid == "10025") { //10025,中信银行在线支付	
            $(".disno1").show();
            $(".disno2").show();
            $(".disno4").show();
            showpay("1000", "5000", "文件证书", "用户自行设置", "用户自行设置", "无", "50万", "", "", "实际支付限额以在银行柜台设置为准，中信热线：95558", "500", "5000", "文件证书和移动证书", "", "", "", "实际支付限额以在银行柜台设置为准，中信热线：95558");
        }
        if (payid == "10028") { //10028,浦发银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno4").show();
            $(".disno5").show();
            showpay("20万", "20万", "开通动态密码版网上支付功能", "自行设置", "自行设置", "开通数字证书版网上支付功能", "", "", "", "实际支付限额以在银行柜台设置为准，浦发热线：95528", "1万", "1万", "大额信用卡-动态密码或数字证书", "自行设置", "自行设置", "小额支付信用卡-开通网上支付功能", "实际支付限额以在银行柜台设置为准，浦发热线：95528");
        }
        if (payid == "10029") { //10029,邮政储蓄银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno3").show();
            $(".disno4").show();
            showpay("1万", "1万", "开通银行手机短信服务", "20万", "20万", "办理电子令牌", "200万", "200万", "办理USB-KEY及开通银行短信服务", "实际支付限额以在银行柜台设置为准，邮储热线：95580", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，邮储热线：95580");
        }
        if (payid == "10001") { //10001,银联在线支付       无
            //$(".disno1").show();
            //$(".disno2").show();
            //$(".disno3").show();
            //$(".disno4").show();
            //showpay("无","无","无","无","无","无","无","无","无","无","无","无","无","无","无","无","无");
            $(".disno1").hide();
            $(".disno2").hide();
            $(".disno3").hide();
            $(".disno4").hide();
            $(".xe_sm").hide();
        }
        if (payid == "10000") { //10000,支付宝       无
            //$(".disno1").show();
            //$(".disno2").show();
            //$(".disno3").show();
            //$(".disno4").show();
            //showpay("无","无","无","无","无","无","无","无","无","无","无","无","无","无","无","无","无");
            $(".disno1").hide();
            $(".disno2").hide();
            $(".disno3").hide();
            $(".disno4").hide();
            $(".xe_sm").hide();
        }

        if (payid == "10023") { //10023,渤海银行在线支付
            $(".disno1").show();
            //$(".disno2").show();
            //$(".disno3").show();
            $(".disno4").show();
            showpay("2万", "10万", "无", "", "", "", "", "", "", "实际支付限额以在银行柜台设置为准，渤海热线：400-888-8811", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，渤海热线：400-888-8811");
        }
        if (payid == "10031") { //10031,华夏银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno3").show();
            $(".disno4").show();
            showpay("300", "1000", "网上支付密码验证", "500", "2000", "手机动态验证", "5000", "2万", "数字证书验证", "实际支付限额以在银行柜台设置为准，华夏热线：95577", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，华夏热线：95577");
        }
        if (payid == "10032") { //10032,广发银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            //$(".disno3").show();
            $(".disno4").show();
            $(".disno5").show();
            showpay("3000", "3000", "手机动态验证码", "30万", "30万", "key盾", "", "", "", "实际支付限额以在银行柜台设置为准，广发热线：400-830-8003", "1万", "1万", "手机动态验证码", "50万", "50万", "KEY盾", "实际支付限额以在银行柜台设置为准，广发热线：95508");
        }
        if (payid == "10033") { //10033,上海银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            $(".disno3").show();
            $(".disno4").show();
            $(".disno5").show();
            showpay("2000", "无", "签约上银快付业务", "6000", "1万", "办理动态密码版个人网银（含文件证书）", "50万", "100万", "办理E盾证书专业版个人网银", "实际支付限额以在银行柜台设置为准，上海热线：95594", "6000", "1万", "办理动态密码版个人网银（含文件证书）", "5万", "信用卡本身透支额度", "办理E盾证书专业版个人网银", "实际支付限额以在银行柜台设置为准，上海热线：95594");
        }
        if (payid == "10034") { //10034,浙商银行在线支付
            $(".disno1").show();
            $(".disno2").show();
            //$(".disno3").show();
            $(".disno4").show();
            showpay("200", "1000", "手机密码支付", "5000", "5000", " 专业版USB-KEY ", "", "", "", "实际支付限额以在银行柜台设置为准，浙商热线：95527", "无", "无", "无", "", "", "", "实际支付限额以在银行柜台设置为准，浙商热线：95527");
        }
    }

    /*显示值*/
    function showpay(xe1, xe2, xe3, xe4, xe5, xe6, xe7, xe8, xe9, xe10, xe11, xe12, xe13, xe14, xe15, xe16, xe17) {
        $('#xe1').html(xe1);
        $('#xe2').html(xe2);
        $('#xe3').html(xe3);
        $('#xe4').html(xe4);
        $('#xe5').html(xe5);
        $('#xe6').html(xe6);
        $('#xe7').html(xe7);
        $('#xe8').html(xe8);
        $('#xe9').html(xe9);
        $('#xe10').html(xe10);
        $('#xe11').html(xe11);
        $('#xe12').html(xe12);
        $('#xe13').html(xe13);
        $('#xe14').html(xe14);
        $('#xe15').html(xe15);
        $('#xe16').html(xe16);
        $('#xe17').html(xe17);
    }
});
